//----------------------------------------------------------------------------------------------------------------------
//	CMPEG4MediaSource.h			©2020 Stevo Brock	All rights reserved.
//----------------------------------------------------------------------------------------------------------------------

#pragma once

//----------------------------------------------------------------------------------------------------------------------
// MARK:  CMPEG4MediaSource

class CMPEG4MediaSource {
	// Methods
	public:
						// Lifecycle methods
						CMPEG4MediaSource() {}
						~CMPEG4MediaSource() {}

						// Instance methods
};
