//----------------------------------------------------------------------------------------------------------------------
//	CTreeItem.h			©2021 Stevo Brock		All rights reserved.
//----------------------------------------------------------------------------------------------------------------------

#pragma once

//----------------------------------------------------------------------------------------------------------------------
// MARK: CTreeItem

class CTreeItem {
	// Methods
	public:

				// Lifecycle methods
				CTreeItem() {}
				CTreeItem(const CTreeItem& other) {}
		virtual	~CTreeItem() {}

				// Instance methods
};
